In [1]:
import numpy as np
import pandas as pd

In [3]:
from numpy import random

Conditional Selection

In [4]:
df = pd.DataFrame(random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [5]:
df

          W         X         Y         Z
A  1.851280 -0.257063  1.008816  0.598654
B  0.274586 -0.369916 -0.208082 -1.319795
C -0.736153 -0.870003  0.757236 -1.782293
D -0.657524  0.158608  0.527268  1.215860
E  0.269773 -0.755545  0.082537  1.416047

dataframe will return boolean value if

In [6]:
df>0

       W      X      Y      Z
A   True  False   True   True
B   True  False  False  False
C  False  False   True  False
D  False   True   True   True
E   True  False   True   True

Passing boolean value of the df to actual data of df

In [8]:
booldf = df>0

In [9]:
booldf

       W      X      Y      Z
A   True  False   True   True
B   True  False  False  False
C  False  False   True  False
D  False   True   True   True
E   True  False   True   True

In [10]:
df[booldf]

          W         X         Y         Z
A  1.851280       NaN  1.008816  0.598654
B  0.274586       NaN       NaN       NaN
C       NaN       NaN  0.757236       NaN
D       NaN  0.158608  0.527268  1.215860
E  0.269773       NaN  0.082537  1.416047

We get (not a number)NaN indication for false value

Another way

In [11]:
df[df>0]

          W         X         Y         Z
A  1.851280       NaN  1.008816  0.598654
B  0.274586       NaN       NaN       NaN
C       NaN       NaN  0.757236       NaN
D       NaN  0.158608  0.527268  1.215860
E  0.269773       NaN  0.082537  1.416047

Retriving specific column with condition

In [12]:
df['W']>0

A     True
B     True
C    False
D    False
E     True
Name: W, dtype: bool

Filtering out the data (returning only true value of W)

In [13]:
df[df['W']>0]

          W         X         Y         Z
A  1.851280 -0.257063  1.008816  0.598654
B  0.274586 -0.369916 -0.208082 -1.319795
E  0.269773 -0.755545  0.082537  1.416047

In [15]:
result = df[df['W']>0]

In [16]:
result['X']

A   -0.257063
B   -0.369916
E   -0.755545
Name: X, dtype: float64

Another short way to return X

In [17]:
df[df['W']>0]['X']

A   -0.257063
B   -0.369916
E   -0.755545
Name: X, dtype: float64

In [19]:
df[df['W']>0][['X','Z']]

          X         Z
A -0.257063  0.598654
B -0.369916 -1.319795
E -0.755545  1.416047

Concepts on multiple conditions

In [21]:
df[(df['W']>0) & (df['Z']>1)]

          W         X         Y         Z
E  0.269773 -0.755545  0.082537  1.416047

and operator

In [23]:
df[(df['W']>0) | (df['Z']>1)]

          W         X         Y         Z
A  1.851280 -0.257063  1.008816  0.598654
B  0.274586 -0.369916 -0.208082 -1.319795
D -0.657524  0.158608  0.527268  1.215860
E  0.269773 -0.755545  0.082537  1.416047

OR operator

In [25]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.851280 -0.257063  1.008816  0.598654
1     B  0.274586 -0.369916 -0.208082 -1.319795
2     C -0.736153 -0.870003  0.757236 -1.782293
3     D -0.657524  0.158608  0.527268  1.215860
4     E  0.269773 -0.755545  0.082537  1.416047

reset_index() show the default index of the dataframe without changing
actual dataframe

In [26]:
newind = 'CA NP IN US BR'.split()

In [27]:
'CA NP IN US BR'.split()

['CA', 'NP', 'IN', 'US', 'BR']

In [28]:
newind

['CA', 'NP', 'IN', 'US', 'BR']

In [29]:
df['State'] = newind

In [30]:
df

          W         X         Y         Z State
A  1.851280 -0.257063  1.008816  0.598654    CA
B  0.274586 -0.369916 -0.208082 -1.319795    NP
C -0.736153 -0.870003  0.757236 -1.782293    IN
D -0.657524  0.158608  0.527268  1.215860    US
E  0.269773 -0.755545  0.082537  1.416047    BR

In [33]:
df.set_index('State')

              W         X         Y         Z
State
CA     1.851280 -0.257063  1.008816  0.598654
NP     0.274586 -0.369916 -0.208082 -1.319795
IN    -0.736153 -0.870003  0.757236 -1.782293
US    -0.657524  0.158608  0.527268  1.215860
BR     0.269773 -0.755545  0.082537  1.416047

Reseting the index

In [34]:
df

          W         X         Y         Z State
A  1.851280 -0.257063  1.008816  0.598654    CA
B  0.274586 -0.369916 -0.208082 -1.319795    NP
C -0.736153 -0.870003  0.757236 -1.782293    IN
D -0.657524  0.158608  0.527268  1.215860    US
E  0.269773 -0.755545  0.082537  1.416047    BR

In [35]:
df.set_index('State', inplace=True)

In [36]:
df

              W         X         Y         Z
State
CA     1.851280 -0.257063  1.008816  0.598654
NP     0.274586 -0.369916 -0.208082 -1.319795
IN    -0.736153 -0.870003  0.757236 -1.782293
US    -0.657524  0.158608  0.527268  1.215860
BR     0.269773 -0.755545  0.082537  1.416047